{
    "areas":
    {
        "Mall":
        {
            "default": "Hall",
            "rooms":
            {

                "Hall":
                {
                    "shortDescription" : "Hall \nMain area of the Mall. You are next to a big fountain, there are all kinds of shops around you. \nPossible commands:\n\t 'look', 'move', 'travel', 'help', 'map', 'quit'",
                    "longDescription":
                    {
                        "0": "This place feels like it was taken from a horror movie. Not a single soul in sight, the ground is covered in inches of dust and the sign have fallen off from the shops. \nThe fountain is completely empty, many lights aren't even working. You can see how few people dare just to go this far from their shelters.",
                        "20": "You notice a strange smell in the air. It's salty... They must've switched the water in the fountain, because how valuable drinking water became. \nYou also discover, how they changed every greenery to fake plant, since nothing could survive here anymore. ",
                        "40": "In the hall you see a few people with big shopping bags, waiting for their friends or families. If you look past them, you see lines at the shops' checkouts. \nAll around are big discount posters, trying to lure you in the stores for stuff you don't actually need.",
                        "60": "The splashing of the fountain, and the chatter gives a calming background noise. You see all kinds of people looking for all kinds of things to buy. \nMany store advertise that they are \"x\"% carbon-neutral, or locally sourced. The prices seem a bit higher, but it might just be worth it.",
                        "80": "In the middle, there's an garden inside, for people to do their work, study or simply recharge their social battery. It's nice to see that natures presence here. \nThe shops all have deals for those, who want to think long term, and buy products that last long, and don't need an annual upgrade."
                    },
                    "actions": [],
                    "events": [],
                    "npcs": [
                    ],
                    "exits":
                    {
                        "restaurant": "Restaurant",
                        "clothingstore": "ClothingStore",
                        "fastfood": "FastFood"
                    }
                },

                "FastFood":
                    {
                        "shortDescription" : "FastFood \nYou can get food, but its done fast.\nPossible commands:\n\t 'look', 'move', 'travel', 'interact', 'help', 'map', 'quit'",
                        "longDescription": 
                        {
                            "0": "You step in, and see only empty, oily papers around. One machine is running up front, and you can hear someone speak in the back rooms.",
                            "20": "When you walk in you only see a couple sitting at the window. By the looks of it the place hasn't been cleaned in days, and something smells.",
                            "40": "There are many people inside, all looking bored, uninterested. They just want to get over this day. There's an empty ordering machine just a few steps from you.",
                            "60": "This restaurant isn't what you expected. It's clean, good looking, and besides the normal hamburgers and side dishes, there is a locally sourced selection.",
                            "80": "When you step in you notice the amount of natural light coming into the main space. \nPeople are smiling and chatting, and most of the items on the menu have a stamp on them, marking the enviromentally friendly."
                        },
                        "actions": [],
                        "events": [],
                        "npcs": [
                            "./assets/npcs/adam.json"
                        ],
                        "exits":
                        {
                            "restaurant": "Restaurant",
                            "clothingstore": "ClothingStore",
                            "hall": "Hall"
                        }
                    },

                "Restaurant":
                    {
                        "shortDescription" : "Restaurant \nThis place has a reputation for using local ingredients, but also is a bit more expensive than the competitors. \nPossible commands:\n\t 'look', 'move', 'travel', 'interact', 'help', 'map', 'quit'",
                        "longDescription": 
                        {
                            "0": "This place is nothing like it used to be. The flowers are dead, the beautiful wood interior is cracked, the painting on the wall is falling of. \nSince local food production is almost impossible the food here is less than acceptable.",
                            "20": "No one is sitting outside. Walking in you see a few people, but given that the prices of locally grown food costs several times more than before only a very few people can afford to eat here.",
                            "40": "The restaurant is having a busy night, people waiting in line. This is the place you want to take your relatives for a birthday dinner. The food is great, and also less damaging for the natural world.",
                            "60": "The place is thriving, people are chatting, laughing, having a good time with their loved ones. Its also running for \"The Restaurant of the Town\" award, and everybody thinks it has really good chances.",
                            "80": "The crowd favourite. Since the uprising of local farming, the cost of dining here has gone down quite a bit, but that doesn't mean that the quality has takes a hit. It's still remarkably good."
                        },
                        "actions": [],
                        "events": [],
                        "npcs": [
                            "./assets/npcs/anna.json"
                        ],
                        "exits":
                        {
                            "clothingstore": "ClothingStore",
                            "fastfood": "FastFood",
                            "hall": "Hall"
                        }
                    },

                "ClothingStore":
                    {
                        "shortDescription" : "ClothingStore \nA clothing store filled with all kinds of fashion ware. \nPossible commands:\n\t 'look', 'move', 'travel', 'help', 'map', 'quit'",
                        "longDescription":
                        {
                            "0": "The first thing you notice, is how little the selection is. There are only generic colour shirts, with the most basic signs on them. \n This may be because only the super large printing factories remained due the cotton shortage, and they have to make the clothes appealing to everyone.",
                            "20": "You heard this store had a little financial trouble since the rise of gas prices, and shipment fees. But you didn't think it was this bad. \nOther than this seasons clothes, every isle is empty.",
                            "40": "You are lucky, there are many special offers. You can see every size, and every color of clothes, varying from summer dresses, to the most rugged winter jackets.",
                            "60": "After stepping in, and walking past the kids section, there's a special corner, where you can buy faulty clothes for cheaper prices. \nThe store is not promoting this, but a recently passed law forces cloth makers to not throw out usable, but not perfect products.",
                            "80": "Next to the door, there's a huge sign advertising that the factory, from where this store is getting its products, is carbon-neutral. A few products even have \"recycled\" tags on them."
                        },
                        "actions": [],
                        "events": [],
                        "npcs": [
                        ],
                       "exits":
                        {
                            "restaurant": "Restaurant",
                            "fastfood": "FastFood",
                            "hall": "Hall"
                        }
                    }
            }
        },

        "Home":
        {
            "default": "Livingroom",
            "rooms":
            {
                "Livingroom":
                {
                    "shortDescription" : "LivingRoom \nThe main area of the house. \nPossible commands:\n\t 'look', 'move', 'travel', 'help', 'map', 'quit'",
                    "longDescription":
                    {
                        "0": "You are standing by the couch. Your favourite picture is on the wall in front of you. The kitchen door is cracked open, a good smell is creeping from there."
                    }, 
                    "actions": [],
                    "events": [],
                    "npcs": [
                    ],
                   "exits":
                    {
                        "kitchen": "Kitchen",
                        "bedroom": "Bedroom",
                        "bathroom":"Bathroom"
                    }
                },

                "Bedroom":
                {
                    "shortDescription" : "Your bedroom. \nPossible commands:\n\t 'look', 'move', 'travel', 'sleep', 'help', 'map', 'quit'",
                    "longDescription": 
                    {
                       "0": "You are in the bedroom. The TV is on, just as a background noise. Light is coming in from the living room."
                    },
                    "actions": ["nextTurn"],
                    "events": [],
                    "npcs": [
                    ],
                    "exits":
                    {
                        "livingroom": "Livingroom",
                        "kitchen": "Kitchen",
                        "bathroom":"Bathroom"

                    }
                },

                "Kitchen":
                {
                    "shortDescription": "Kitchen \nThe small kitchen of your home. \nPossible commands:\n\t 'look', 'move', 'travel', 'sort', 'help', 'map', 'quit'",
                    "longDescription":
                    {
                        "0": "In the kitchen you can't find any food, even though you can smell something... Well too bad. A few dirty plates are in the sink, but luckily you know that that's not your problem."
                    },
                    "actions": ["sort"],
                    "events": [],
                    "npcs": [
                    ],
                   "exits":
                    {
                        "livingroom": "Livingroom",
                        "bedroom": "Bedroom",
                        "bathroom":"Bathroom"
                    }
                },

                "Bathroom":
                {
                    "shortDescription" : "A bathroom... Nothing special. \nPossible commands:\n\t 'look', 'move', 'travel', 'interact', 'help', 'map', 'quit'",
                    "longDescription": 
                    {
                        "0": "It really is just a bathroom... There is nothing special."
                    },
                    "actions": [],
                    "events": [],
                    "npcs": [
                        "./assets/npcs/mirror.json"
                    ],
                   "exits":
                    {
                        "livingroom":"Livingroom",
                        "kitchen": "Kitchen",
                        "bedroom": "Bedroom"
                    }
                }
            }
        },
        "Town":
        {
            "default": "MainSquare",
            "rooms":
            {
                "MainSquare":
                {
                    "shortDescription" : "MainSquare \nThe main square of the town, one corner from the bus station. \nPossible commands:\n\t 'look', 'move', 'travel', 'interact', 'help', 'map', 'quit'",
                    "longDescription":
                    {
                        "0": "The plastic trees that the government has planted to keep the good vibe up have also lost their leaves. It didn't seem possible, but chances are that no one has looked after them in a very long time. \nThere's a non-passing centimeter of sand on the ground, and on worse days, you can hardly see a few meters because of air-pollution.",
                        "20": "The green patch in the middle has been replaced by fake plants. The actual ones couldn't survive in these conditions. The cafés are still busy, just not as much as usually. \nThe constant smog makes it hard to breathe, and unpleasant to stay outside for longer than needed.",
                        "40": "The town's main square is surrounded by cute little cafés. It's a little greenpatch surrounded by glass giants. There are benches situated under the shade of the trees. On the bench's armrest you see a lizard and a ladybug just sitting next to each other. \nThe place is surprisingly well lit, compared to how tall buildings stand around it. It's because the sunlight bounces around on those huge windows.",
                        "60": "When you look around you see that a few cafés have joined the action against unlawful, and environmentally harmful ways of farming coffee, and are proudly showing it off with huge banners. \nThe sidewalks have more green areas, made up of bushes and other plants. When you look up at one of the trees, there sits a little ladybug with a lizard, looking back at you. Nature truly is amazing.",
                        "80": "Only busses are allowed in the main square. Other than that no vehicle can come near the middle of the town. This way there are more spacious and more well lit roads, surrounded by trees. \nSince there are no cars, there are no traffic jams, and the well timed bus rides can get anyone, anywhere on time. On a parking bus's windshield is a small lizard and a ladybug just chilling out."
                    },
                    "actions": [],
                    "events": [],
                    "npcs": [
                    ],
                    "exits":
                    {
                        "park": "Park",
                        "arcade": "Arcade",
                        "bar":"Bar"
                    }
                },

                "Park":
                {
                    "shortDescription" : "Park \nIt is the city park, with the great lake in the middle. \nPossible commands:\n\t 'look', 'move', 'travel', 'interact', 'help', 'map', 'quit'",
                    "longDescription": 
                    {
                        "0": "Everything that has made this place beautiful has died, because no sunlight is getting to the ground. Even the large pines that could maybe get just enough light to survive aren't alive anymore. \nIt's because the lake's water is full of garbage, and it pollutes everything in its area. There are no more reasons to come here.",
                        "20": "Even if you tried, you couldn't find any of the famous bunnies, they had to be moved, since nothing they can eat was able to grow in conditions like these. And it's perfectly understandable, since practically only large trees are alive.",
                        "40": "When you walk past the tree line on the park's edge you see a few people kayaking, a couple swimming. Others are running, walking their dogs and picnicking.",
                        "60": "The municipality is putting a big emphasis on providing green places for people, and it is very noticeable. This park is magnificent. Not a piece of trash in sight, everything is well maintained and clean. \nThere are more benches and tables for people to eat, instead of eating in the closed and crowded restaurants.",
                        "80": "Many people love spending their days outside. Even more people have the chance to get the feeling of walking in the mountains, or on a in a meadow of flowers, because of this beautifully maintained park. \nActually there isn't a lot maintaining to do, nature is just thriving here, you almost can't notice that you are in a big city."
                    },
                    "actions": [],
                    "events": [],
                    "npcs": [
                    ],
                    "exits":
                    {
                        "arcade": "Arcade",
                        "bar":"Bar",
                        "mainsquare": "MainSquare"
                    }
                },

                "Arcade":
                {
                    "shortDescription" : "Arcade \nTHE place for vintage games. \nPossible commands:\n\t 'look', 'move', 'travel', 'interact', 'help', 'map', 'quit'",
                    "longDescription":
                    {
                        "0": "Anywhere you look, you see the most popular games ever made, huge arcade machines and the whole place just screams 80's vibes."
                    },
                    "actions": [],
                    "events": [],
                    "npcs": [
                    ],
                    "exits":
                    {
                        "park": "Park",
                        "bar":"Bar",
                        "mainsquare": "MainSquare"
                    }
                },

                "Bar":
                {
                    "shortDescription" : "Bar \nThe best site to catch up with friends and blow of a bit of steam. \nPossible commands:\n\t 'look', 'move', 'travel', 'interact', 'help', 'map', 'quit'",
                    "longDescription": 
                    {
                        "0": "When you step in, you immediately hear the music, can smell the mixture of booze and tobacco. \nPeople are chatting and laughing, friends are reuniting, college students are celebrating their survival of a class."
                    },
                    "actions": [],
                    "events": [],
                    "npcs": [
                        "./assets/npcs/bob.json"
                    ],
                    "exits":
                    {
                        "park": "Park",
                        "arcade": "Arcade",
                        "mainsquare": "MainSquare"
                    }
                }
            }
        },
        "Work":
        {
            "default": "Breakroom",
            "rooms":
            {
                "Breakroom":
                {
                    "shortDescription" : "Breakroom \nThe main hangout area for colleagues. \nPossible commands:\n\t 'look', 'move', 'travel', 'interact', 'help', 'map', 'quit'",
                    "longDescription": 
                    {
                        "0": "In the breakroom you find a few co-workers finally getting their coffee needed for their survival. You hear constant ringing and typing from the office areas."
                    },
                    "actions": [],
                    "events": [],
                    "npcs": [
                        "./assets/npcs/Arturas.json",
                        "./assets/npcs/Maya.json"
                    ],
                    "exits":
                    {
                        "office":"Office",
                        "boss":"Boss"
                    }
                },

                "Boss":
                {
                    "shortDescription" : "Boss \nYour bosses spacious and shiny office. \nPossible commands:\n\t 'look', 'move', 'travel', 'interact', 'help', 'map', 'quit'",
                    "longDescription": 
                    {
                        "0": "When you look around you notice how much better your boss's office is than yours. It has a lot of natural light, plants and a ton of space. \nExpensive looking paintings hang on the walls. On the walls that are not glass, because of course it is a corner office."   
                    },
                    "actions": [],
                    "events": [],
                    "npcs": [
                        "./assets/npcs/boss.json"
                    ],
                    "exits":
                    {
                        "office":"Office",
                        "breakroom": "Breakroom"
                    }
                },

                "Office":
                {
                    "shortDescription" : "Office \nYour second home, shared with all your colleagues. \nPossible commands:\n\t 'look', 'move', 'travel', 'interact', 'work', 'help', 'map', 'quit'",
                    "longDescription": 
                    {
                        "0": "You have arrived at your little work space. It's nothing special, with a desk separated from the other by small wall. \nYour plant, named George, is at the corner of your desk, partially behind your monitor. He is there to remind you how beautiful the world outside is."
                    },
                    "actions": ["work"],
                    "events": [],
                    "npcs": [
                        "./assets/npcs/george.json"
                    ],
                    "exits":
                    {
                        "boss":"Boss",
                        "Breakroom":"Breakroom"
                    }
                }
            }
        }
    }
}